#
# Homebrew Bundle
# See: https://github.com/Homebrew/homebrew-bundle
#

#
# 'brew tap'
#

tap "homebrew/bundle"
tap "homebrew/cask"

#
# 'brew install'
#

brew "coreutils"
brew "curl"
brew "git"
brew "gnupg"
brew "mas"
brew "nano"
brew "node"
brew "jq"
brew "tmux"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"

#
# 'brew install --cask'
#

cask "adobe-creative-cloud"
cask "chatgpt"
cask "discord"
cask "figma"
cask "google-chrome"
cask "tunnelbear"
cask "visual-studio-code"

#
# 'mas install'
#

mas "Data Jar", id: 1453273600
mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id:462062816
#mas "Xcode", id: 497799835
