#
# Homebrew Bundle
# See: https://github.com/Homebrew/homebrew-bundle
#

#
# 'brew tap'
#

tap "homebrew/bundle"
tap "homebrew/cask"

#
# 'brew install'

brew "coreutils"
brew "curl"
brew "git"
brew "gnupg"
brew "mas"
brew "nano"
brew "node"
brew "jq"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"

#
# 'brew install --cask'
#

cask "adobe-creative-cloud"
cask "discord"
cask "figma"
cask "google-chrome"
cask "grammarly-desktop"
cask "miro"
cask "protonvpn"
cask "slack"
cask "visual-studio-code"

#
# 'mas install'
#

mas "Data Jar", id: 1453273600
mas "Gifski", id:  1351639930
mas "Magnet", id: 441258766
mas "TestFlight", id:899247664
